Revit 2027 API
IndependentTag.RemoveReferences Method
 Removes the provided list of references from the tag's list of references.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void RemoveReferences(
	IList<Reference> referencesToRemove
)
Public Sub RemoveReferences (
	referencesToRemove As IList(Of Reference)
)
public:
void RemoveReferences(
	IList<Reference^>^ referencesToRemove
)
member RemoveReferences :
        referencesToRemove : IList<Reference> -> unit
Parameters
referencesToRemove IList<Reference>
 References to be removed from tag.
Exceptions
Exception | Condition
ArgumentException |  The operation failed. Please verify that the references are all tagged before removing them.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  The IndependentTag object does not have a tag behavior. -or- Modifying tag references for MRA owned tag from API is not allowed.
Remarks
 If the tag is owned by MRA element, an exception will be thrown.
See Also
Reference
IndependentTag Class
Autodesk.Revit.DB Namespace